log/123456/20220415140128/disk2.log
========= Data Disk NO.2 Read And Write Begin  2022-04-15 14:01:30 ==========
The Command Line ->>> ./tools/fio -filename=/dev/sdd -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=1G -numjobs=10 -runtime=7200 -group_reporting -time_based -name=mytest_2

mytest_2: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_2: (groupid=0, jobs=10): err= 0: pid=5748: Fri Apr 15 16:01:31 2022
  read: IOPS=373, BW=5972KiB/s (6115kB/s)(41.0GiB/7200050msec)
    clat (usec): min=93, max=897056, avg=24543.83, stdev=51037.16
     lat (usec): min=93, max=897057, avg=24544.26, stdev=51037.16
    clat percentiles (usec):
     |  1.00th=[   202],  5.00th=[   330], 10.00th=[   396], 20.00th=[   676],
     | 30.00th=[  1237], 40.00th=[  1647], 50.00th=[  1926], 60.00th=[  2671],
     | 70.00th=[ 15139], 80.00th=[ 33817], 90.00th=[ 83362], 95.00th=[131597],
     | 99.00th=[242222], 99.50th=[291505], 99.90th=[404751], 99.95th=[450888],
     | 99.99th=[566232]
   bw (  KiB/s): min=  312, max=19252, per=100.00%, avg=5981.59, stdev=261.87, samples=143737
   iops        : min=   12, max= 1201, avg=373.44, stdev=16.37, samples=143737
  write: IOPS=373, BW=5977KiB/s (6120kB/s)(41.0GiB/7200050msec); 0 zone resets
    clat (usec): min=138, max=662003, avg=2228.27, stdev=11607.47
     lat (usec): min=140, max=662006, avg=2231.44, stdev=11607.49
    clat percentiles (usec):
     |  1.00th=[   194],  5.00th=[   217], 10.00th=[   233], 20.00th=[   260],
     | 30.00th=[   289], 40.00th=[   322], 50.00th=[   375], 60.00th=[   482],
     | 70.00th=[   668], 80.00th=[  1221], 90.00th=[  2057], 95.00th=[  7701],
     | 99.00th=[ 33162], 99.50th=[ 72877], 99.90th=[177210], 99.95th=[219153],
     | 99.99th=[325059]
   bw (  KiB/s): min=  310, max=23921, per=100.00%, avg=6004.70, stdev=313.45, samples=143308
   iops        : min=   10, max= 1493, avg=374.89, stdev=19.59, samples=143308
  lat (usec)   : 100=0.01%, 250=9.44%, 500=28.91%, 750=8.53%, 1000=4.10%
  lat (msec)   : 2=19.83%, 4=7.03%, 10=3.58%, 20=4.50%, 50=5.85%
  lat (msec)   : 100=4.14%, 250=3.62%, 500=0.46%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.13%, sys=0.20%, ctx=5377032, majf=0, minf=3185
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2687305,2689614,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5972KiB/s (6115kB/s), 5972KiB/s-5972KiB/s (6115kB/s-6115kB/s), io=41.0GiB (44.0GB), run=7200050-7200050msec
  WRITE: bw=5977KiB/s (6120kB/s), 5977KiB/s-5977KiB/s (6120kB/s-6120kB/s), io=41.0GiB (44.1GB), run=7200050-7200050msec

Disk stats (read/write):
  sdd: ios=2687358/2689614, merge=0/0, ticks=65877850/5931630, in_queue=71807336, util=100.00%
================== Data disk NO.2 End ====================